**`commonimages/components`** terraform plan on `pull_request` event [#207](${url})

```
data.aws_secretsmanager_secret.environment_management: Reading...
data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
data.aws_secretsmanager_secret_version.environment_management: Reading...
data.aws_secretsmanager_secret_version.environment_management: Read complete after 1s [id=<REDACTED>]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
aws_imagebuilder_component.this["python_3_6.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["yum_packages.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["powershell_core.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["aws_cli.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["python_3_9.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["ansible.yml"]: Refreshing state... [id=<REDACTED>]
aws_imagebuilder_component.this["prometheus_windows_exporter.yml"]: Refreshing state... [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_imagebuilder_component.this["ansible.yml"] must be replaced
+/- resource "aws_imagebuilder_component" "this" {
      ~ arn                   = "arn:aws:imagebuilder:eu-west-2:374269020027:component/ansible/0.0.10/1" -> (known after apply)
      ~ data                  = <<-EOT # forces replacement
            ---
            name: ansible
            description: Install ansible roles
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
          -       default: 0.0.10
          +       default: 0.0.11
                  description: "Component version, increment if you make changes."
              - Platform:
                  type: string
                  default: "Linux"
                  description: Platform.
              - Ami:
                  type: string
                  description: "Name of AMI. There must be a group_vars/ami_$Ami file in the repo."
              - Branch:
                  type: string
                  default: main
                  description: Git branch to use when cloning the ansible repo
              - AnsibleRepo:
                  type: string
                  default: modernisation-platform-configuration-management
                  description: The ansible github repo to clone
              - AnsibleRepoDir:
                  type: string
                  default: ansible
                  description: The directory in the repo where the ansible code is found
              - AnsibleTags:
                  type: string
                  default: amibuild
                  description: The tags to run ansible with
              - AnsibleArgs:
                  type: string
                  default: ""
                  description: Any other additional arguments to pass into ansible
            phases:
              - name: build
                steps:
                  # Install ansible roles
                  - name: InstallAndRunAnsible
                    action: ExecuteBash
                    inputs:
                      commands:
                        - |
                          # do not set -u as it breaks on RedHat 6
                          set -eo pipefail
                          PATH=$PATH:/usr/local/bin
                          run_ansible() {
                            # define all params here to make standalone testing of script easier
                            repo="{{ AnsibleRepo }}"
                            ami_tag="{{ Ami }}"
                            ansible_repo_dir="{{ AnsibleRepoDir }}"
                            ansible_tags="{{ AnsibleTags }}"
                            ansible_args="{{ AnsibleArgs }}"
                            branch="{{ Branch }}"
            
                            # clone ansible roles and playbook
                            yum install -y git
                            ansible_dir=$(mktemp -d)
                            echo "Cloning $repo into $ansible_dir using branch=$branch"
                            cd $ansible_dir
                            git clone -b $branch "https://github.com/ministryofjustice/$repo.git"
            
                            # set python version
                            # check if already installed (e.g. RHEL6/7 via python component)
                            if [[ $(which python3.9 2> /dev/null) ]]; then
                              python=$(which python3.9)
                            elif [[ $(which python3.6 2> /dev/null) ]]; then
                              python=$(which python3.6)
                            else
                              # otherwise just install via yum
                              yum install -y python39 || true
                              if [[ $(which python3.9 2> /dev/null) ]]; then
                                python=$(which python3.9)
                              else
                                echo "Python3.9/3.6 not found"
                                exit 1
                              fi
                            fi
                            echo "python: $python"
            
                            # install python dependencies outside of virtual env so ansible
                            # can be executed remotely
                            cd $ansible_dir/$repo/$ansible_repo_dir
                            $python -m pip install -r requirements.txt
            
                            # activate virtual environment
                            mkdir $ansible_dir/python-venv && cd "$_"
                            $python -m venv ansible
                            source ansible/bin/activate
                            $python -m pip install --upgrade pip
                            if [[ "$python" =~ 3.6 ]]; then
                              $python -m pip install wheel
                              $python -m pip install cryptography==2.3
                              export LC_ALL=en_US.UTF-8
                              $python -m pip install ansible-core==2.11.12
                            else
                              $python -m pip install ansible==6.0.0
                            fi
            
                            # install requirements in virtual env
                            cd $ansible_dir/$repo/$ansible_repo_dir
                            $python -m pip install -r requirements.txt
                            ansible-galaxy role install -r requirements.yml
                            ansible-galaxy collection install -r requirements.yml --force
            
                            # run ansible (note comma after localhost is deliberate)
                            ansible-playbook site.yml \
                            --connection=local \
                            --inventory localhost, \
                            --extra-vars "ansible_python_interpreter=$python" \
                            --extra-vars "target=localhost" \
                            --extra-vars "@group_vars/ami_$ami_tag.yml" \
                            --tags "$ansible_tags" \
                            --become $ansible_args
            
                            # Cleanup
                            deactivate
                            echo "Cleaning up $ansible_dir"
                            rm -rf $ansible_dir/$repo
                            rm -rf $ansible_dir/python-venv
                            rmdir $ansible_dir
                          }
                          echo "ansible $ami_tag start" | logger -p local3.info -t ami-component
                          run_ansible 2>&1 | logger -p local3.info -t ami-component -s 2>&1
                          echo "ansible $ami_tag end" | logger -p local3.info -t ami-component
        EOT
      ~ date_created          = "2023-11-30T13:29:38.085Z" -> (known after apply)
      ~ encrypted             = true -> (known after apply)
      ~ id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/ansible/0.0.10/1" -> (known after apply)
        name                  = "ansible"
      ~ owner                 = "374269020027" -> (known after apply)
      - supported_os_versions = [] -> null
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
      ~ type                  = "BUILD" -> (known after apply)
      ~ version               = "0.0.10" -> "0.0.11" # forces replacement
        # (4 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["aws_cli.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/aws-cli/0.0.3/1"
        name                  = "aws_cli"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["powershell_core.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/powershell-core/0.3.0/1"
        name                  = "powershell_core"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["prometheus_windows_exporter.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/prometheus-windows-exporter/1.1.7/1"
        name                  = "prometheus_windows_exporter"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["python_3_6.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/python-3-6/0.0.4/1"
        name                  = "python_3_6"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["python_3_9.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/python-3-9/0.0.3/1"
        name                  = "python_3_9"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

  # aws_imagebuilder_component.this["yum_packages.yml"] will be updated in-place
  ~ resource "aws_imagebuilder_component" "this" {
        id                    = "arn:aws:imagebuilder:eu-west-2:374269020027:component/yum-packages/0.0.1/1"
        name                  = "yum_packages"
      ~ tags                  = {
            "application"   = "n/a"
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
            "business-unit" = "HMPPS"
          ~ "is-production" = "false" -> "true"
            "owner"         = "digital-studio-operations-team@digital.justice.gov.uk"
            "source-code"   = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/commonimages/components"
        }
      ~ tags_all              = {
          ~ "branch"        = "dso-2239/ansible-failure-handling-in-ami-builds" -> "main"
          ~ "is-production" = "false" -> "true"
            # (4 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "account_to_distribute_ami"
but a value was found in file "terraform.tfvars". If you meant to use this
value, add a "variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

```
